IDEA Open Model
RebarSingle.RotationXrad Property
Compatible with IDEA StatiCa 20.1
 Returns the rotation (in radians) of the rebar geometry (RebarShape). It is an angle of rotation around AxisX of the reference line.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public double RotationXrad { get; set; }
Public Property RotationXrad As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarSingle Class
IdeaRS.OpenModel.Model Namespace